{
  "title": "About",
  "date": "2018-07-07T03:00:50-07:00",
  "thumbnail": "/images/uploads/old-pic.jpg",
  "body": "# Fast approaching it's 100 year anniversary, West Herts Hockey club has vast and successful history\n\nThe club was inaugurated in 1921, making a base at the West Herts Sports Ground, Cassio Rd, Watford; where it was to remain  for some 82 years until redevelopment works to the changing facilities and bar necessitated a move to the Sun Sports ground in Bellmount Wood Avenue, Watford. \n\nOur earliest substantial documentation of the club is an extant fixture card from the 1923-24 season, when the club was a two team entity. The President was a Major E. G. Monro, who remained in that office until 1953-54! Vice Presidents included The Earls of Clarendon and Essex, and the Rt. Hon Lord Leverhulme (of Unilever fame) . Club subscription was 1 ½ guineas.\n \nGiven that road transport would have been restricted (later records indicate that a coach was hired for team transport), the fixture list was largely based upon local matches but also included visits to The Royal Observatory at Greenwich, and Ilford. Times of trains to Watford from Euston and Broad Street were printed on the rear of the card, perhaps indicating that an element of the membership was based in London. \n\nThe club remained as a two team outfit until after the 2nd World War when it expanded to four teams, many new players arrived courtesy of a connection with the youth club of St. Luke's church in the Cassiobury estate. The extra teams used a pitch in Cassiobury Park, with players walking from Park Avenue across Rickmansworth Rd. \n\nAfter a period of consolidation the club grew again in the late '60s with the addition of a 5th team captained by Luke Lucas who gave his name to the trophy which is awarded annually to the most improved young men's player. A 6th team followed in the early '70s and by this time we were playing on a third grass pitch at Park Avenue; the rugby club having moved to a new home. \n\n  With the advent of league hockey West Herts failed to become part of the inaugural London League and had to join the East Leagues when they began. Success wasn't too long coming with several Division 1 titles. \n\n  The arrival of Graeme Welch at Watford Grammar School was the catalyst in developing hockey there and a string of talented players have come to play their hockey with Stags. This connection has developed and now there are up and coming juniors all the way through the club. At times in the past the entire 1st XI was \"Old Fullerian\".\n\n  What still ranks as the most notable period in the Club's history is the three years between 1995 and 1997 when the men won the HA trophy (Now the \"Harrod\" trophy), beating Coventry & North Warwicks, De Montfort University and Bowdon (now of the NHL).  \n\nThis stood unparalleled until Banbury won their third final in 2007/8- although these were not consecutive wins.  \n\nIn 1997-98 we teamed up with the Grammar school to raise funds for the new astroturf pitch at Coningesby Drive and with its' arrival an end was begun to the fragmentation of travelling to the local sports centre for our home games and playing at disjointed times of day, along with the demise of sociability in the bar after the game. The new pitch was inaugurated in 1998 and has been an enormous success, being so successful financially that it was relaid ahead of schedule and the new surface is the envy of many visiting sides. This has had a marked \"pull\" effect on the rest of the ladies sides and the second team play in the Five Counties Premier division and the 3rds and 4ths are both making steady progress up the leagues.\n\n  Since the expansion to six men's sides the club has continued to thrive and, after much debate the ladies section was inaugurated out of the ashes of Watford Ladies in 1987. It has expanded to four teams in just 22 years. In that time the ladies 1st XI has risen to the top of the East league tree and have been consistent performers in the Premier division.  \n\nOff the field, the bar at Park Avenue was a bastion of the \"Real Ale\" revival with successive stewards catering for this taste. David Gahan, while being a legendary champion of the brews was also not always a fan of the boisterous behaviour brought on by the fermented hop and its' by products, but a Stags' players usually knows his ale. Several away trips are highlighted by a beer stop, including that trip to Bishop's Stortford which has long involved a break for refreshment and a gargantuan plate of food at the Nag's Head at Little Hadham. The short lived but spectacular tour to Southwold involved consuming prodigious quantities of Adnams' ale.\n\n  There was great upheaval in 2002 when we were forced, we thought temporarily, out of our home due to redevelopment but it soon became obvious that this would be permanent and we now reside close to the astroturf at Sun Sports Club. Real Ale is a distant memory on some Saturday afternoons, but the club is now a different much more junior-based entity, with the hope that the current members will play the game through to adulthood just as many of the current committee have done.  \n\nThe men achieved National League status in 2013 and the ladies followed in 2016.\n"
}